Thornbots/MCBV3/MCB-project/src/communication/i2c/inc/stm32f4xx_hal_rcc_ex.hpp
/** @defgroup RCCEx_APB2_Clock_Enable_Disable APB2 Peripheral Clock Enable Disable
  * @brief  Enable or disable the High Speed APB (APB2) peripheral clock.
  * @note   After reset, the peripheral clock (used for registers read/write access)
  *         is disabled and the application software has to enable this clock before
  *         using it.
  * @{
  */
#define __HAL_RCC_TIM8_CLK_ENABLE()   do { \
                                           volatile std::uint32_t tmpreg = 0x00U; \
                                           SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM8EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM8EN);\
                                           UNUSED(tmpreg); \
                                         } while(0U)
#define __HAL_RCC_ADC2_CLK_ENABLE()   do { \
                                           volatile std::uint32_t tmpreg = 0x00U; \
                                           SET_BIT(RCC->APB2ENR, RCC_APB2ENR_ADC2EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_ADC2EN);\
                                           UNUSED(tmpreg); \
                                         } while(0U)
#define __HAL_RCC_ADC3_CLK_ENABLE()   do { \
                                           volatile std::uint32_t tmpreg = 0x00U; \
                                           SET_BIT(RCC->APB2ENR, RCC_APB2ENR_ADC3EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_ADC3EN);\
                                           UNUSED(tmpreg); \
                                         } while(0U)
#define __HAL_RCC_SPI5_CLK_ENABLE()   do { \
                                           volatile std::uint32_t tmpreg = 0x00U; \
                                           SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI5EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI5EN);\
                                           UNUSED(tmpreg); \
                                         } while(0U)
#define __HAL_RCC_SPI6_CLK_ENABLE()   do { \
                                           volatile std::uint32_t tmpreg = 0x00U; \
                                           SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI6EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI6EN);\
                                           UNUSED(tmpreg); \
                                         } while(0U)
#define __HAL_RCC_SAI1_CLK_ENABLE()   do { \
                                           volatile std::uint32_t tmpreg = 0x00U; \
                                           SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI1EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SAI1EN);\
                                           UNUSED(tmpreg); \
                                         } while(0U)
#define __HAL_RCC_SDIO_CLK_ENABLE()     do { \
                                             volatile std::uint32_t tmpreg = 0x00U; \
                                             SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);\
                                             /* Delay after an RCC peripheral clock enabling */ \
                                             tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SDIOEN);\
                                             UNUSED(tmpreg); \
                                           } while(0U)
#define __HAL_RCC_SPI4_CLK_ENABLE()     do { \
                                             volatile std::uint32_t tmpreg = 0x00U; \
                                             SET_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI4EN);\
                                             /* Delay after an RCC peripheral clock enabling */ \
                                             tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_SPI4EN);\
                                             UNUSED(tmpreg); \
                                           } while(0U)
#define __HAL_RCC_TIM10_CLK_ENABLE()    do { \
                                             volatile std::uint32_t tmpreg = 0x00U; \
                                             SET_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM10EN);\
                                             /* Delay after an RCC peripheral clock enabling */ \
                                             tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_TIM10EN);\
                                             UNUSED(tmpreg); \
                                           } while(0U)
#define __HAL_RCC_SDIO_CLK_DISABLE()   (RCC->APB2ENR &= ~(RCC_APB2ENR_SDIOEN))
#define __HAL_RCC_SPI4_CLK_DISABLE()   (RCC->APB2ENR &= ~(RCC_APB2ENR_SPI4EN))
#define __HAL_RCC_TIM10_CLK_DISABLE()  (RCC->APB2ENR &= ~(RCC_APB2ENR_TIM10EN))
#define __HAL_RCC_TIM8_CLK_DISABLE()   (RCC->APB2ENR &= ~(RCC_APB2ENR_TIM8EN))
#define __HAL_RCC_ADC2_CLK_DISABLE()   (RCC->APB2ENR &= ~(RCC_APB2ENR_ADC2EN))
#define __HAL_RCC_ADC3_CLK_DISABLE()   (RCC->APB2ENR &= ~(RCC_APB2ENR_ADC3EN))
#define __HAL_RCC_SPI5_CLK_DISABLE()   (RCC->APB2ENR &= ~(RCC_APB2ENR_SPI5EN))
#define __HAL_RCC_SPI6_CLK_DISABLE()   (RCC->APB2ENR &= ~(RCC_APB2ENR_SPI6EN))
#define __HAL_RCC_SAI1_CLK_DISABLE()   (RCC->APB2ENR &= ~(RCC_APB2ENR_SAI1EN))

#if defined(STM32F429xx)|| defined(STM32F439xx) || defined(STM32F469xx) || defined(STM32F479xx)
#define __HAL_RCC_LTDC_CLK_ENABLE()  do { \
                                          volatile std::uint32_t tmpreg = 0x00U; \
                                          SET_BIT(RCC->APB2ENR, RCC_APB2ENR_LTDCEN);\
                                          /* Delay after an RCC peripheral clock enabling */ \
                                          tmpreg = READ_BIT(RCC->APB2ENR, RCC_APB2ENR_LTDCEN);\
                                          UNUSED(tmpreg); \
                                        } while(0U)

