Thornbots/MCBV3/MCB-project/src/communication/i2c/inc/stm32f4xx_hal_rcc_ex.hpp
#if defined(STM32F413xx) || defined(STM32F423xx)
#define __HAL_RCC_UART4_CLK_ENABLE()  do { \
                                           volatile std::uint32_t tmpreg = 0x00U; \
                                           SET_BIT(RCC->APB1ENR, RCC_APB1ENR_UART4EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_UART4EN);\
                                           UNUSED(tmpreg); \
                                         } while(0U)
#define __HAL_RCC_UART5_CLK_ENABLE()  do { \
                                           volatile std::uint32_t tmpreg = 0x00U; \
                                           SET_BIT(RCC->APB1ENR, RCC_APB1ENR_UART5EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_UART5EN);\
                                           UNUSED(tmpreg); \
                                         } while(0U)
#endif /* STM32F413xx || STM32F423xx */

#define __HAL_RCC_FMPI2C1_CLK_ENABLE() do { \
                                            volatile std::uint32_t tmpreg = 0x00U; \
                                            SET_BIT(RCC->APB1ENR, RCC_APB1ENR_FMPI2C1EN);\
                                            /* Delay after an RCC peripheral clock enabling */ \
                                            tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_FMPI2C1EN);\
                                            UNUSED(tmpreg); \
                                          } while(0U)
#define __HAL_RCC_CAN1_CLK_ENABLE()   do { \
                                           volatile std::uint32_t tmpreg = 0x00U; \
                                           SET_BIT(RCC->APB1ENR, RCC_APB1ENR_CAN1EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_CAN1EN);\
                                           UNUSED(tmpreg); \
                                         } while(0U)
#define __HAL_RCC_CAN2_CLK_ENABLE()   do { \
                                           volatile std::uint32_t tmpreg = 0x00U; \
                                           SET_BIT(RCC->APB1ENR, RCC_APB1ENR_CAN2EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_CAN2EN);\
                                           UNUSED(tmpreg); \
                                         } while(0U)
#if defined(STM32F413xx) || defined(STM32F423xx)
#define __HAL_RCC_CAN3_CLK_ENABLE()  do { \
                                          volatile std::uint32_t tmpreg = 0x00U; \
                                          SET_BIT(RCC->APB1ENR, RCC_APB1ENR_CAN3EN);\
                                          /* Delay after an RCC peripheral clock enabling */ \
                                          tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_CAN3EN);\
                                          UNUSED(tmpreg); \
                                        } while(0U)
#endif /* STM32F413xx || STM32F423xx */
#define __HAL_RCC_TIM2_CLK_ENABLE()     do { \
                                             volatile std::uint32_t tmpreg = 0x00U; \
                                             SET_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM2EN);\
                                             /* Delay after an RCC peripheral clock enabling */ \
                                             tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM2EN);\
                                             UNUSED(tmpreg); \
                                           } while(0U)
#define __HAL_RCC_TIM3_CLK_ENABLE()     do { \
                                             volatile std::uint32_t tmpreg = 0x00U; \
                                             SET_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM3EN);\
                                             /* Delay after an RCC peripheral clock enabling */ \
                                             tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM3EN);\
                                             UNUSED(tmpreg); \
                                           } while(0U)
#define __HAL_RCC_TIM4_CLK_ENABLE()     do { \
                                             volatile std::uint32_t tmpreg = 0x00U; \
                                             SET_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM4EN);\
                                             /* Delay after an RCC peripheral clock enabling */ \
                                             tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_TIM4EN);\
                                             UNUSED(tmpreg); \
                                           } while(0U)
#define __HAL_RCC_SPI3_CLK_ENABLE()     do { \
                                             volatile std::uint32_t tmpreg = 0x00U; \
                                             SET_BIT(RCC->APB1ENR, RCC_APB1ENR_SPI3EN);\
                                             /* Delay after an RCC peripheral clock enabling */ \
                                             tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_SPI3EN);\
                                             UNUSED(tmpreg); \
                                           } while(0U)
#define __HAL_RCC_I2C3_CLK_ENABLE()     do { \
                                             volatile std::uint32_t tmpreg = 0x00U; \
                                             SET_BIT(RCC->APB1ENR, RCC_APB1ENR_I2C3EN);\
                                             /* Delay after an RCC peripheral clock enabling */ \
                                             tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_I2C3EN);\
                                             UNUSED(tmpreg); \
                                           } while(0U)
#if defined(STM32F413xx) || defined(STM32F423xx)
#define __HAL_RCC_DAC_CLK_ENABLE()    do { \
                                           volatile std::uint32_t tmpreg = 0x00U; \
                                           SET_BIT(RCC->APB1ENR, RCC_APB1ENR_DACEN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_DACEN);\
                                           UNUSED(tmpreg); \
                                         } while(0U)
#define __HAL_RCC_UART7_CLK_ENABLE()  do { \
                                           volatile std::uint32_t tmpreg = 0x00U; \
                                           SET_BIT(RCC->APB1ENR, RCC_APB1ENR_UART7EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_UART7EN);\
                                           UNUSED(tmpreg); \
                                         } while(0U)
#define __HAL_RCC_UART8_CLK_ENABLE()  do { \
                                           volatile std::uint32_t tmpreg = 0x00U; \
                                           SET_BIT(RCC->APB1ENR, RCC_APB1ENR_UART8EN);\
                                           /* Delay after an RCC peripheral clock enabling */ \
                                           tmpreg = READ_BIT(RCC->APB1ENR, RCC_APB1ENR_UART8EN);\
                                           UNUSED(tmpreg); \
                                         } while(0U)
#endif /* STM32F413xx || STM32F423xx */

